Autodesk.Revit.DB.Events.ExternalDataTypeUpdatingDataSourceIntoDocumentEventArgs.TypeId
The type id of the external data type that is being updated.
Since:
2025.2

Autodesk.Revit.DB.Events.ExternalDataTypeUpdatingDataSourceIntoDocumentEventArgs
The event arguments used by the ExternalDataTypeUpdatingDataSourceInto event.
Since:
2025.2